package condition;

public class Condition {
    public static void condition33() {
        //Вычислите (x-(y)^0.5)^0.5, если x и y вводит пользователь. Перед вычислением выполнить проверку
        // на существование квадратных корней.
    }

    public static void condition34() {
        //Дано число. Если оно больше 3, то увеличить число на 10, иначе уменьшить на 10.
    }

    public static void condition35() {
        //Дано число. Если оно меньшн 7, то вывести Yes, если больше 10, то вывести No, если равно 9, то вывести Error.
    }

    public static void condition36() {
        //Пользователь вводит номер месяца, вывести название месяца.
    }

    public static void condition37() {
        //Дано два числа. Вывести наибольшее из них.
    }

    public static void condition38() {
        //Дано два числа. Вывести yes, если они отличаются на 100, иначе вывести No.
    }

    public static void condition39() {

    }

    public static void condition40() {

    }

    public static void condition41() {

    }

    public static void condition42() {

    }

    public static void condition43() {
        //Пользователь вводит номер месяца. Вывести название поры года (весна, лето и тд)
    }
    public static void condition44() {

    }
    public static void condition45() {

    }
    public static void condition46() {

    }
    public static void condition47() {
        //Даны три числа. Найдите наибольшее число из них.
    }
    public static void condition48() {

    }
    public static void condition49() {

    }
    public static void condition50() {

    }
    public static void condition55() {
        //Дано три числа. Найти количество положительных чисел среди них.
    }

    public static void condition60() {
        //Дано трехзначное число. Переставьте первую и последнюю цифры.
    }

    public static void condition61() {
        //Дано четырехзначное число. Определите, есть ли одинаковые цифры в нем.
    }

    public static void condition62() {

    }

    public static void condition63() {

    }

    public static void condition64() {
        //Дано четырехзначное число. Если оно читается слева направо и справа налево одинаково, то вывести yes, иначе no
    }

    public static void condition65() {
        //Дано четырехзначное число. Переставьте местами так, чтобы сначала оказались цифры, меньше пяти.
    }

    public static void condition66() {
        //Даны два трехзначных числа. Получите новое число присоединением второго числа справа к первому без
        //последних цифр у каждого. Например, 123 и 456 Ответ: 1245
    }

    public static void condition67() {
        //Дано четырехзначное число. Поменяйте местами наименьшую и наибольшую цифры.
    }

    public static void condition68() {

    }

    public static void condition69() {

    }

    public static void condition70() {

    }

    public static void condition71() {

    }

    public static void condition72() {

    }

    public static void condition73() {

    }

    public static void condition74() {

    }

    public static void all() {
        System.out.println("\nЗадание 34");
        System.out.println("\nЗадание 35");
        System.out.println("\nЗадание 36");
        System.out.println("\nЗадание 37");
        System.out.println("\nЗадание 38");
        System.out.println("\nЗадание 39");
        System.out.println("\nЗадание 43");
        System.out.println("\nЗадание 47");
        System.out.println("\nЗадание 48");
        System.out.println("\nЗадание 50");
        System.out.println("\nЗадание 53");
        System.out.println("\nЗадание 54");
        System.out.println("\nЗадание 55");
        System.out.println("\nЗадание 58");
        System.out.println("\nЗадание 59");
        System.out.println("\nЗадание 60");
        System.out.println("\nЗадание 64");
        System.out.println("\nЗадание 67");

    }
}
